<span>
<img src="http://www.sobigdata.eu/sites/default/files/logo-SoBigData-DEFINITIVO.png" width="180px" align="right"/>
</span>
<span>
<b>Author:</b> <a href="http://about.giuliorossetti.net">Giulio Rossetti</a><br/>
<b>Python version:</b>  3.x<br/>
<b>Last update:</b> 12/12/2017
</span>

<a id='top'></a>
# *Data Manipulation with Pandas*

In [ ]:
import numpy as np
import pandas as pd

## 1. Series
Pandas Series can be build by leveraging different data types

From numerical data

In [75]:
my_data = [10,20,30]
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

From numerical data and corresponding index (row labels)

In [76]:
labels = ['A','B','C']
pd.Series(data=my_data, index=labels)

A    10
B    20
C    30
dtype: int64

Just using a pre-defined dictionary

In [77]:
d = {'A':10,'B':20,'C':30}
pd.Series(d)

A    10
B    20
C    30
dtype: int64

### 1.2 Indexing and Slicing
Series can be indexed and sliced

In [79]:
ser = pd.Series([1, 2, 3, 4], ['A', 'B', 'C', 'D'])

print("by name, A:", ser['A'])
print("by positional value in the series, A:", ser[0])
print("by range, B:D\n", ser[1:4], sep='')

by name, A: 1
by positional value in the series, A: 1
by range, B:D
B    2
C    3
D    4
dtype: int64

### 1.3 Adding/Merging two Series having common indices

In [80]:
ser1 = pd.Series([1, 2, 3, 4], ['A', 'B', 'C', 'D'])
ser2 = pd.Series([1, 2, 5, 4], ['A', 'B', 'E', 'D'])
ser3 = ser1+ser2

After adding the two series, the result looks like this...

In [81]:
ser3

A    2.0
B    4.0
C    NaN
D    8.0
E    NaN
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing <br/>
The same happens for all possible operations (e.g., product)

In [82]:
ser1*ser2

A     1.0
B     4.0
C     NaN
D    16.0
E     NaN
dtype: float64

## 4. DataFrame

In [157]:
from numpy.random import randn as rn

### 4.1 Creating and accessing DataFrame
We start generating some random data...

In [158]:
np.random.seed()
matrix_data = rn(5,4)
matrix_data

array([[-0.6566564 , -0.47280545,  0.1354953 ,  0.91744833],
       [-0.61597918, -0.51307342,  0.33450237, -0.23862023],
       [ 1.41217901, -0.04277876,  0.67502066,  0.47739812],
       [-0.3913604 , -0.43722113,  0.98600403, -1.23689387],
       [ 0.63580697,  0.36742478,  0.46672082,  0.07552234]])

Now we can transform such random matrix in a DataFrame

In [159]:
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
df

          W         X         Y         Z
A -0.656656 -0.472805  0.135495  0.917448
B -0.615979 -0.513073  0.334502 -0.238620
C  1.412179 -0.042779  0.675021  0.477398
D -0.391360 -0.437221  0.986004 -1.236894
E  0.635807  0.367425  0.466721  0.075522

Simple statistics can be obtained through the *describe* method

In [160]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.076798 -0.219691  0.519549 -0.001029
std    0.912798  0.378637  0.326451  0.815807
min   -0.656656 -0.513073  0.135495 -1.236894
25%   -0.615979 -0.472805  0.334502 -0.238620
50%   -0.391360 -0.437221  0.466721  0.075522
75%    0.635807 -0.042779  0.675021  0.477398
max    1.412179  0.367425  0.986004  0.917448

### 4.2 Indexing and slicing (columns)

Slicing a single column produces a Series...

In [86]:
df['X']

A   -1.107616
B   -1.386359
C    0.117346
D    0.388399
E   -0.771703
Name: X, dtype: float64

In [87]:
type(df['X'])

pandas.core.series.Series

An alternative syntax to access a single column is the *dot* notation

In [88]:
df.X

A   -1.107616
B   -1.386359
C    0.117346
D    0.388399
E   -0.771703
Name: X, dtype: float64

To obtain a DataFrame an additional bracket must be used

In [89]:
df[['X']]

          X
A -1.107616
B -1.386359
C  0.117346
D  0.388399
E -0.771703

In [90]:
type(df[['X']])

pandas.core.frame.DataFrame

In [91]:
df[['X','Z']] # Multiple selection

          X         Z
A -1.107616 -0.015992
B -1.386359  0.698615
C  0.117346  0.762202
D  0.388399 -0.075488
E -0.771703 -1.436637

### 4.3 Creating and deleting a (new) column (or row)

Adding a novel column combining existing ones

In [92]:
df['SumXY'] = df['X'] + df['Z']
df['DiffXY'] = df['X'] - df['Y']
df

          W         X         Y         Z     SumXY    DiffXY
A  1.259949 -1.107616  0.419117 -0.015992 -1.123609 -1.526733
B  0.351491 -1.386359  0.712903  0.698615 -0.687744 -2.099262
C  2.525321  0.117346 -0.715794  0.762202  0.879548  0.833140
D -1.200567  0.388399 -2.346749 -0.075488  0.312911  2.735149
E  0.541676 -0.771703  0.869508 -1.436637 -2.208340 -1.641211

Deleting an existing column

In [93]:
df = df.drop('X', axis=1)
df

          W         Y         Z     SumXY    DiffXY
A  1.259949  0.419117 -0.015992 -1.123609 -1.526733
B  0.351491  0.712903  0.698615 -0.687744 -2.099262
C  2.525321 -0.715794  0.762202  0.879548  0.833140
D -1.200567 -2.346749 -0.075488  0.312911  2.735149
E  0.541676  0.869508 -1.436637 -2.208340 -1.641211

Deleting a row (index) by using df.drop() method and axis=0

In [95]:
df1 = df.drop('A', axis=0)
df1

          W         Y         Z     SumXY    DiffXY
B  0.351491  0.712903  0.698615 -0.687744 -2.099262
C  2.525321 -0.715794  0.762202  0.879548  0.833140
D -1.200567 -2.346749 -0.075488  0.312911  2.735149
E  0.541676  0.869508 -1.436637 -2.208340 -1.641211

Updates can be performed **inplace** (without reasigning to a variable) by setting inplace=True

In [96]:
df.drop('A', axis=0, inplace=True)
df

          W         Y         Z     SumXY    DiffXY
B  0.351491  0.712903  0.698615 -0.687744 -2.099262
C  2.525321 -0.715794  0.762202  0.879548  0.833140
D -1.200567 -2.346749 -0.075488  0.312911  2.735149
E  0.541676  0.869508 -1.436637 -2.208340 -1.641211

### 4.4 Selecting/indexing Rows
Rows can be indexed by **label** as well as by **index**

In [98]:
df.loc[['B','C']]

          W         Y         Z     SumXY    DiffXY
B  0.351491  0.712903  0.698615 -0.687744 -2.099262
C  2.525321 -0.715794  0.762202  0.879548  0.833140

In [99]:
df.iloc[[1,2]]

          W         Y         Z     SumXY    DiffXY
C  2.525321 -0.715794  0.762202  0.879548  0.833140
D -1.200567 -2.346749 -0.075488  0.312911  2.735149

### 4.5 Subsetting DataFrame
Accessing an element in position (D,Y)

In [101]:
df.loc['D','Y']

-2.3467494019163766

Slicing by rows and columns at the same time

In [102]:
df.loc[['C','D'],['W','Z']]

          W         Z
C  2.525321  0.762202
D -1.200567 -0.075488

### 4.6 Conditional selection
Logical operators can be applied to DataFrame to perform filtering and selections

**Example:** a boolean DataFrame where we are checking if the values are greater than 0

In [111]:
booldf = df>0
booldf

       W      Y      Z  SumXY  DiffXY
B   True   True   True  False   False
C   True  False   True   True    True
D  False  False  False   True    True
E   True   True  False  False   False

A bolean DataFrame can also be used to filter the original values

In [112]:
df[booldf]

          W         Y         Z     SumXY    DiffXY
B  0.351491  0.712903  0.698615       NaN       NaN
C  2.525321       NaN  0.762202  0.879548  0.833140
D       NaN       NaN       NaN  0.312911  2.735149
E  0.541676  0.869508       NaN       NaN       NaN

### 4.7 Conditionally subset a DataFrame with Boolean series
Let's define a DataFrame describing individuals measurements

In [114]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
df

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

We can filter it easily by specifying a condition on the cell values

In [115]:
df[df['Height']>65]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

Multiple conditions can be stacked together using boolean operators

In [116]:
booldf1 = df['Height']>65
booldf2 = df['Weight']>145

In [122]:
booldf2

A    False
B     True
C    False
D     True
E     True
Name: Weight, dtype: bool

In [118]:
df[(booldf1) & (booldf2)]

   Age  Height  Weight
B   42      70     148
D   35      68     160

Filtering results can be subsetted as usual selecting rows/columns

In [119]:
df[booldf1][['Age','Weight']]

   Age  Weight
A   22     140
B   42     148
D   35     160

### 4.8 Re-setting and Setting Index
In the previuos example we specified an index. <br/>
We can destroy such index (making it a simple column of the DataFrame) easily

In [124]:
df.reset_index()

  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

Conversely, if we do not need such additional column we can drop it contextually

In [126]:
df.reset_index(drop=True)

   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

Now we can add a new column and set it as new index

In [127]:
df['Profession'] = ["Student", "Teacher", "Engineer", "Doctor", "Nurse"]
df.set_index('Profession')

            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Doctor       35      68     160
Nurse        25      62     152

### 4.9 Multi-indexing
DataFrame indexes can have multiple levels <br/>
We can define a two level index as follows:

In [130]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

hier_index = list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [132]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

And apply it to a DataFrame as usual

In [133]:
np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(6,3),2), index= hier_index, columns= ['A','B','C'])
df1

         A     B     C
G1 1  2.71  0.63  0.91
   2  0.50  0.65 -0.32
   3 -0.85  0.61 -2.02
G2 1  0.74  0.53 -0.59
   2  0.19 -0.76 -0.93
   3  0.96  0.19  1.98

Subsetting now becomes trikier, but the syntax remains the same. <br/>
We can select the subset (1,3)(B,C) of G2 by using the *loc* function twice

In [135]:
df1.loc['G2'].loc[[1,3]][['B','C']]

      B     C
1  0.53 -0.59
3  0.19  1.98

Indeed, indexes can be named to better identify them

In [138]:
df1.index.names=['Outer', 'Inner']
df1

                A     B     C
Outer Inner
G1    1      2.71  0.63  0.91
      2      0.50  0.65 -0.32
      3     -0.85  0.61 -2.02
G2    1      0.74  0.53 -0.59
      2      0.19 -0.76 -0.93
      3      0.96  0.19  1.98

## 5. Data Transformation

### 5.1 Missing Values
In presence of missing values different policies can be selected

In [139]:
df = pd.DataFrame({'A':[1, 2, np.nan],'B':[5, np.nan, np.nan],'C':[1, 2, 3]})
df['States']=["IT", "FR", "UK"]
df.set_index('States',inplace=True)
df

          A    B  C
States
IT      1.0  5.0  1
FR      2.0  NaN  2
UK      NaN  NaN  3

#### Dropping any rows with a NaN value

In [140]:
df.dropna(axis=0)

          A    B  C
States
IT      1.0  5.0  1

#### Dropping any columns with NaN value

In [141]:
df.dropna(axis=1)

        C
States
IT      1
FR      2
UK      3

#### Thresholding: dropping a row with a minimum 2 NaN

In [142]:
df.dropna(axis=0, thresh=2)

          A    B  C
States
IT      1.0  5.0  1
FR      2.0  NaN  2

#### Filling values with a default value

In [143]:
df.fillna(value='FILL VALUE')

                 A           B  C
States
IT               1           5  1
FR               2  FILL VALUE  2
UK      FILL VALUE  FILL VALUE  3

#### Filling values with a computed value (e.g., mean of column A)

In [144]:
df.fillna(value=df['A'].mean())

          A    B  C
States
IT      1.0  5.0  1
FR      2.0  1.5  2
UK      1.5  1.5  3

### 5.2 GroupBy
DataFrames allow to group rows by column values so to compute aggregated statistics (i.e., sum, mean...)

In [162]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [163]:
byComp = df.groupby('Company')

In [164]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [165]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [169]:
df1 = pd.DataFrame(df.groupby('Company').describe())
df1

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In order to select a single row of the resulting DataFrame it is necessary to:
- access it via *loc*
- transpose the results

In [172]:
df_FB = pd.DataFrame(df1.loc['FB'])
df_FB

                     FB
Sales count    2.000000
      mean   296.500000
      std     75.660426
      min    243.000000
      25%    269.750000
      50%    296.500000
      75%    323.250000
      max    350.000000

In [173]:
df_FB.transpose()

   Sales
   count   mean        std    min     25%    50%     75%    max
FB   2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

The latter operation is not required if the selection is on multiple rows

In [174]:
df.groupby('Company').describe().loc[['GOOG', 'MSFT']]

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
GOOG      2.0  160.0   56.568542  120.0  140.0  160.0  180.0  200.0
MSFT      2.0  232.0  152.735065  124.0  178.0  232.0  286.0  340.0

### 5.3 Concatenating DataFrames

#### Concatenation

In [176]:
# Creating data frames
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [179]:
df_cat1 = pd.concat([df1, df2], axis=0)
df_cat1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [182]:
df_cat2 = pd.concat([df1,df2], axis=1)
df_cat2

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [183]:
df_cat2.fillna(value=0, inplace=True)
df_cat2

    A   B   C   D   A   B   C   D
0  A0  B0  C0  D0   0   0   0   0
1  A1  B1  C1  D1   0   0   0   0
2  A2  B2  C2  D2   0   0   0   0
3  A3  B3  C3  D3   0   0   0   0
4   0   0   0   0  A4  B4  C4  D4
5   0   0   0   0  A5  B5  C5  D5
6   0   0   0   0  A6  B6  C6  D6
7   0   0   0   0  A7  B7  C7  D7

### 5.4 Merging DataFrames

#### Merging by a common 'key'
The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together.

In [184]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [185]:
merge1= pd.merge(left, right, how='inner',on='key')
merge1

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

#### Merging on a set of keys

In [186]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                         'C': ['C0', 'C1', 'C2', 'C3'],
                         'D': ['D0', 'D1', 'D2', 'D3']})

In [187]:
pd.merge(left, right, on=['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [188]:
pd.merge(left, right, how='outer',on=['key1', 'key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [189]:
pd.merge(left, right, how='left',on=['key1', 'key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

In [190]:
pd.merge(left, right, how='right',on=['key1', 'key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

### 5.6 Joining DataFrames
Joining is a convenient method for combining the columns of two **potentially differently-indexed** DataFrames into a single DataFrame based on 'index keys'.

In [192]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [193]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [194]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3